a. Kindly fill the missing values with
1. value
2. Statistical value
3. Filling  method

B. Create pivot table for  position and average salary.

C. Group the data using group by as per gender  and average age.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel(r"C:\Users\Admin\Downloads\ethnic_diversity.xlsx")

In [3]:
df.head()

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
0,"Brown, Mia",1103024456,Accountant I,MA,1450.0,F,Married,US Citizen,Active,Admin Offices,674.28,28,Black or African American
1,"LaRotonda, William",1106026572,Accountant I,MA,1460.0,M,Divorced,US Citizen,Active,Admin Offices,674.28,50,NaN
2,"Steans, Tyrone",1302053333,NaN,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
3,"Howard, Estelle",1211050782,Administrative Assistant,MA,2170.0,F,Married,US Citizen,Terminated for Cause,Admin Offices,NaN,44,White
4,"Singh, Nan",1307059817,Administrative Assistant,MA,2330.0,F,Single,US Citizen,Active,Admin Offices,61089.35,33,White

In [4]:
df.isna().sum()

Employee_Name        0
EmpID                0
Position             6
State                2
Zip                  2
Gender               7
MaritalDesc          9
CitizenDesc          3
EmploymentStatus     0
Department           5
Salaries            12
age                  0
Race                 9
dtype: int64

In [5]:
df['Position'].isna().sum()

6

In [6]:
df[df['Position'].isna()]

,Employee_Name,EmpID,Position,State,Zip,Gender,MaritalDesc,CitizenDesc,EmploymentStatus,Department,Salaries,age,Race
2,"Steans, Tyrone",1302053333,NaN,MA,2703.0,M,Single,US Citizen,Active,Admin Offices,674.28,43,White
91,"Desimone, Carl",1501072124,NaN,MA,2061.0,M,NaN,US Citizen,Active,NaN,15736.71,26,White
95,"Kirill, Alexandra",903013071,NaN,MA,2127.0,F,Married,US Citizen,Voluntarily Terminated,Production,37619.00,44,White
151,"Engdahl, Jean",1007020403,NaN,NaN,2026.0,M,Single,US Citizen,Active,Production,49808.01,54,White
307,"Semizoglou, Jeremiah",904013591,NaN,MA,1545.0,M,Married,US Citizen,Future Start,IT/IS,27587.46,24,Asian
309,"Warfield, Sarah",1301052347,NaN,MA,2453.0,F,Widowed,US Citizen,Active,IT/IS,37257.00,46,Asian

In [7]:
# using value method

In [8]:
df['Position'].fillna('Accountant I',inplace = True)

In [9]:
# using using statistical value method

In [10]:
df['Position'].mode()[0]

'Production Technician I'

In [11]:
df['Position'].fillna(df['Position'].mode()[0],inplace = True)

In [12]:
# using filling method

In [13]:
df['Position'].fillna(method = 'pad',inplace = True) # we can also use the bfill, ffill

In [14]:
df['State'].mode()[0]

'MA'

In [15]:
df['State'].fillna('MA',inplace = True)

In [16]:
df['Zip'].mode()[0]

1886.0

In [17]:
df['Zip'].fillna(df['Zip'].mode()[0],inplace = True)

In [18]:
df['Gender'].mode()[0]

'F'

In [19]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace = True)

In [20]:
df['MaritalDesc'].fillna(method = 'ffill', inplace = True)

In [21]:
df['CitizenDesc'].fillna(method = 'pad', inplace = True)

In [22]:
df['Department'].mode()[0]

'Production       '

In [23]:
df['Department'].fillna('Production', inplace = True)

In [24]:
df['Salaries'].fillna(method = 'bfill', inplace = True)

In [25]:
df['Race'].fillna(method = 'ffill', inplace = True)

In [26]:
df.isna().sum()

Employee_Name       0
EmpID               0
Position            0
State               0
Zip                 0
Gender              0
MaritalDesc         0
CitizenDesc         0
EmploymentStatus    0
Department          0
Salaries            0
age                 0
Race                0
dtype: int64

#### 2. Create pivot table for  position and average salary.

In [27]:
df.pivot_table(values ='Salaries', columns = 'Position', aggfunc= 'mean')

Position,Accountant I,Administrative Assistant,Area Sales Manager,BI Developer,BI Director,CIO,Data Analyst,Data Analyst,Data Architect,Database Administrator,...,Production Technician I,Production Technician II,Sales Manager,Senior BI Developer,Shared Services Manager,Software Engineer,Software Engineering Manager,Sr. Accountant,Sr. DBA,Sr. Network Engineer
Salaries,21253.8775,51528.24,42564.650741,35845.3325,4160.0,26418.01,37772.945714,42304.75,90016.01,33813.996,...,35322.100977,33803.863333,34093.246667,71293.676667,45262.975,39892.308889,40208.0,27349.755,31954.975,25782.846667

In [28]:
df.columns

Index(['Employee_Name', 'EmpID', 'Position', 'State', 'Zip', 'Gender',
       'MaritalDesc', 'CitizenDesc', 'EmploymentStatus', 'Department',
       'Salaries', 'age', 'Race'],
      dtype='object')

#### 3. Group the data using group by as per gender  and average age.

In [29]:
df.groupby('Gender')['age'].mean()

Gender
F     38.670391
M     38.732824
Name: age, dtype: float64